// 1. 获取一个随机小数
let r1 = Math.random();

// 2. 使用这个随机小数乘以 10
let r2 = r1 * 10;

// 3. 对这个数字进行   四舍五入取整
let res = Math.round(r2);

// 输出最后结果
console.log(res);
//！！！ 此方法会导致取0和取10的概率偏低

/* 
 *  0 - 10
 *
 *  0      ~   0.5        0.5   0
 *  0.5    ~   1.5        1     1
 *  1.5    ~   2.5        1     2
 *  2.5    ~   3.5        1     2
 *  3.5    ~   4.5        1     2
 *  4.5    ~   5.5        1     2
 *  5.5    ~   6.5        1     2
 *  6.5    ~   7.5        1     2
 *  7.5    ~   8.5        1     2
 *  8.5    ~   9.5        1     2
 *  9.5    ~   10         0.5   2
 */