// 等概率地选取  0-10这11个整数

// 1. 获取一个随机小数
let r1 = Math.random()

// 2. 使用这个随机小数乘以 11          11 = 10 - 0 + 1
let r2 = r1 * 11                     // r2的取值为0~10

// 3. 对这个数字进行    向下取整
let res = Math.floor( r2 )

// 输出最后结果
// console.log( res )


/* 
 *  0 - 11
 *
 *  0    ~    1          1     0
 *  1    ~    2          1     1
 *  2    ~    3          1     2
 *  3    ~    4          1     3
 *  4    ~    5          1     4
 *  5    ~    6          1     5
 *  6    ~    7          1     6
 *  7    ~    8          1     7
 *  8    ~    9          1     8
 *  9    ~    10         1     9
 *  10   ~    11         1     10
 */