<template>
  <div>
    <div>引用图片的尺寸 600*600</div>
    <img src="./1.jpg" class="imgCSS" alt="what's the fuck" />
  </div>
</template>

<script setup></script>

<style scope>
.imgCSS {
  height: 800px;
  width: 80px;
  background-color: green;

  /* object-fit: cover; */
  /* 被替换的内容在保持其宽高比的同时填充元素的整个内容框。如果对象的宽高比与内容框不相匹配，该对象将被剪裁以适应内容框。 
      
      除去刚好的长宽比例，其他情况均取图片  某一边  的正中间，需要缩小、放大以刚好适应比例大的那一边，然后裁切到刚好沾满 img 的宽高
      */

  object-fit: contain;
  /* 被替换的内容将被缩放(缩小或放大)，以在填充元素的内容框时保持其宽高比。整个对象在填充盒子的同时保留其长宽比，因此如果宽高比与框的宽高比不匹配，该对象将被添加“黑边” 
      
      图片居中，以比例小的一边对图片进行缩小、放大以展示全部内容，除去刚刚好，其他情况均会在  比例长的那边  出现 “黑边” （在此种情况下即是出现绿色的底）
      */

  /* object-fit: fill; */
  /* 被替换的内容  正好  填充元素的内容框。整个对象将完全填充此框。如果对象的宽高比与内容框不相匹配，那么该对象将被拉伸以适应内容框。 */

  /* 整张图片填满img区域，通过拉伸或压缩到刚好合适，不会出现“黑边”，也不会裁剪， */

  /* object-fit: scale-down; */
  /* 内容的尺寸与 none 或 contain 中的一个相同，取决于它们两个之间谁得到的对象尺寸会更小一些。 */

  /* object-fit: none; */
  /* 被替换的内容将保持其原有的尺寸。 */

  /* 上面的解释来自  MDN，下面的是自己的理解 */
}
</style>
