<template>
  <div>
    <h1>我是一级标题</h1>
    <h2>我是二级标题</h2>
    <h3>我是二级标题</h3>
    <h4>我是二级标题</h4>
    <h5>我是二级标题</h5>
    <h6>我是二级标题</h6>
    <!-- 自带加粗，有自己的文本大小，独占一行，有自己的间距 -->
    <!-- h1标签最好只有一个，它的权重最大，爬虫会将h1中的内容当做整片文章的中心 -->

    <p>
      百度
      <strong>（英文名：<i>Baidu</i>, Inc. <em>度集團股份有限公司）</em></strong>

      是一家<b>主要经营搜</b>
      索引擎服务的互联网公司，于<i>2000年1月1日</i>由李彦宏、徐勇两人在北京中
      <br />
      关村创立。
    </p>

    <!-- 
        b       strong                          加粗
        i       em                              倾斜
        s       del                             删除线
        u                                       下划线
        sup                                     上标
        sub                                     下标
     -->
    <p>
      “百度”源自中国南宋词人辛弃疾的词：众里寻他千百度，描述了
      <br />
      词人对理想的执着追求。<s><u>公司</u></s
      >业务范<u><del>围覆盖了</del></u
      >搜索、人工智能、云计算、大
      <br />
      数据等方面，是中国互联网公司三巨头之一。

      <u>
        <sup>我的天</sup>
        <sub>加油</sub>
      </u>
    </p>

    <hr />
  </div>
</template>

<script setup></script>

<style scope></style>
