<template>
  <div>
    <h2>normal</h2>
    <p class="p1">我把一切都给你，潮湿的发梢给你，深夜的呢喃给你，拙劣的情话给你，眼底的星星 给你，血液的奔涌给你，小心翼翼给你，奋不顾身给你，寒风给你，炙热给你，清晨 日落早安晚安，带着炙热的心跳，余生所有的全给你。</p>

    <h2>10px</h2>
    <p class="p2">我把一切都给你，潮湿的发梢给你，深夜的呢喃给你，拙劣的情话给你，眼底的星星 给你，血液的奔涌给你，小心翼翼给你，奋不顾身给你，寒风给你，炙热给你，清晨 日落早安晚安，带着炙热的心跳，余生所有的全给你。</p>

    <h2>-2px  负值让字符更紧凑</h2>
    <p class="p3">我把一切都给你，潮湿的发梢给你，深夜的呢喃给你，拙劣的情话给你，眼底的星星 给你，血液的奔涌给你，小心翼翼给你，奋不顾身给你，寒风给你，炙热给你，清晨 日落早安晚安，带着炙热的心跳，余生所有的全给你。</p>
  </div>
</template>

<script setup></script>

<style scoped>
.p1 {
  letter-spacing: normal;
}

.p2 {
  letter-spacing: 10px;
}

.p3 {
  letter-spacing: -2px;
}
</style>
